---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Mechanical.MechanicalEquipmentSetType
source: html/cdb6b519-5f21-cbd4-4c1f-fafa795a169b.htm
---
# MechanicalEquipmentSetType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.